In [3]:
import pandas as pd

In [17]:
angels = pd.read_csv('Player List_files/angels_players.csv')

In [18]:
angels.head(5)

     Player List
0           Name
1   Jaime Barria
2    Dylan Bundy
3      Alex Cobb
4  Shohei Ohtani

In [7]:
#angels['Team'] = pd.Series(['Angels' for x in range(len(angels.index))])

In [8]:
angels.head(5)

     Player List    Team
0           Name  Angels
1   Jaime Barria  Angels
2    Dylan Bundy  Angels
3      Alex Cobb  Angels
4  Shohei Ohtani  Angels

In [19]:
angels = angels.drop(labels=0)

In [20]:
angels.head(5)

       Player List
1     Jaime Barria
2      Dylan Bundy
3        Alex Cobb
4    Shohei Ohtani
5  Chris Rodriguez

In [22]:
angels = angels.rename(columns={'Player List' : 'Name'})

In [23]:
angels.head(5)

              Name
1     Jaime Barria
2      Dylan Bundy
3        Alex Cobb
4    Shohei Ohtani
5  Chris Rodriguez

In [27]:
angels['Team'] = [i for i in range(len(angels))]

In [28]:
angels.head(5)

              Name  Team
1     Jaime Barria     0
2      Dylan Bundy     1
3        Alex Cobb     2
4    Shohei Ohtani     3
5  Chris Rodriguez     4

In [30]:
for index, row in angels.iterrows():
    angels['Team'] = 'Angels'

In [31]:
angels.head

<bound method NDFrame.head of                                                  Name    Team
1                                        Jaime Barria  Angels
2                                         Dylan Bundy  Angels
3                                           Alex Cobb  Angels
4                                       Shohei Ohtani  Angels
5                                     Chris Rodriguez  Angels
6                                        Steve Cishek  Angels
7                                       Junior Guerra  Angels
8                                          James Hoyt  Angels
9                                       Brian Johnson  Angels
10                                        Mike Mayers  Angels
11                                         Felix Pena  Angels
12                                          Ben Rowen  Angels
13                                   Patrick Sandoval  Angels
14                                    Raisel Iglesias  Angels
15                                         Max Stassi  Angels
16                                        Kurt Suzuki  Angels
17                                        Jared Walsh  Angels
18                                   Franklin Barreto  Angels
19                                         Jose Rojas  Angels
20                                     Anthony Rendon  Angels
21                                     David Fletcher  Angels
22                                      Jack Mayfield  Angels
23                                       Juan Lagares  Angels
24                                       Justin Upton  Angels
25                                         Mike Trout  Angels
26                                      Dexter Fowler  Angels
27  Tuesday, April 5th , 2022 - OOTP Baseball 22.1...  Angels>